{"services":[{"title":"Bedbugs","image":"/src/links/bedbug.jpg","description":"Our treatment process consists of insecticide, traps and steam.\n\n* Insecticide plays an important but limited role in treatment. Bedbugs have developed a resistance to insecticide, therefore it is important to use small amounts that are strategically placed.\n* Traps are a valuable tool in the treatment process. The trap we find most effective is a simple trap that is placed under each leg of the bed frame. In addition to isolating the bed, these traps catch bedbugs that could be hiding in places away from the bed.\n* The main focus of our treatment is the use of steam. Although time consuming, steam is the most effective way to eliminate all stages of a bedbug infestation.\n\nThree treatments is the average needed to eliminate an infestation. Depending on the severity of the infestation there may be additional treatments required."},{"title":"Insect Control","image":"/src/links/ant-hill.jpg","description":"​When extra help is required, Integrated Pest Management (IPM) through Certified Pest Control offers reliable and predictable control of nuisance and/or damaging insect pests. Our programs are designed to control pests using a range of approaches, including the responsible and professional use of pesticides. They prove very effective for controlling and eliminating areas where infestations are forecasted.\n\n​Timely applications are absolutely essential when controlling insects. At CPC, we monitor local insect pest populations and track their lifecycles in order to forecast potential infestations, and to time the application of insecticides for the most effective control.\n\n​Our technicians are licensed and trained to control insect pests. We will work with you and instruct you on what to do before and after an application in order to achieve the best results.\n\n​Common insects we deal with are:\n\n* Ants\n* Bedbugs\n* Cockroaches\n* Earwigs\n* Spiders\n* Wasps"},{"title":"Wildlife Removal","image":"/src/links/racoon.jpg","description":"Wildlife is a big part of our environment. Unfotunately there are opportunistic animals that often make their homes inside or on our property.\n\nAt Certified Pest Control we take a humane approach to removing or excluding these animals from your home. The animals are never harmed and as little stress as possible is caused in removing the animals. Mother and babies are kept together and through our proven techniques the animals are encouraged to relocate to an alternate den site.\n\nCommon wildlife animals we deal with are:\n\n* Bats\n* Birds\n* Chipmunks\n* Mice\n* Opossums"}],"packages":{"bronze":[{"visit":"May/June"}],"silver":[{"visit":"May/June"},{"visit":"August/September"}],"gold":[{"visit":"May"},{"visit":"July"},{"visit":"September"}]},"addOns":[{"addOn":"Interior insect control"},{"addOn":"Rodent control, seasonal or year-round depending on needs"}]}